<a href="https://colab.research.google.com/github/GhostBug-007/College_Rank_Predictor/blob/master/IR.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [0]:
import bs4 as bs
import nltk
import urllib.request
import re
import pandas as pd

In [0]:
univ_global = []
rating_global = [] 
start = 23

In [0]:
n = 20            # n is the number of pages you wanna scrape, 1 < n < 370
for i in range(1,n,1):
    print(i)
    arr = []
    univ_orig = []
    rating_orig = []
    arr5 = []
    page = 'https://atcoder.jp/ranking?page='
    scraped_data = urllib.request.urlopen(page+str(i))  
    article =scraped_data.read()
    parsed_article = bs.BeautifulSoup(article,'html.parser')
    paragraphs = parsed_article.find_all("span", {"class": "ranking-affiliation break-all"})
    for each in paragraphs:
        arr.append(str(each.get_text()))
    for a in arr:
        if a == '' or a == ' ':
            continue
        else:
            univ_orig.append(a)
    univ_global.extend(univ_orig)
    parsed_article1 = bs.BeautifulSoup(article,'html.parser')
    paragraphs1 = parsed_article.find_all("td")
    univ = -1

    for rating in range(start,len(paragraphs1),7):
        univ = univ + 1
        if arr[univ] == '' or arr[univ] == ' ':
            continue
        arr5.append(paragraphs1[rating])
    for each in arr5:
        inp = str(each.get_text())
        rating_orig.append(int(inp))
    rating_global.extend(rating_orig)

1
2
3
4

In [0]:
# # parsed_article = bs.BeautifulSoup(article,'html.parser')
# # paragraphs = parsed_article.find_all("span", {"class": "ranking-affiliation break-all"})

# # for each in arr5:
# #     inp = str(each.get_text())
# #     rating_orig.append(int(inp))

# len(rating_global)

In [0]:
# parsed_article1 = bs.BeautifulSoup(article,'html.parser')
# paragraphs1 = parsed_article.find_all("td")

In [0]:
# for each in paragraphs:
# #     print(str(each.get_text()))
#     arr.append(str(each.get_text()))

In [0]:
# for a in arr:
#     if a == '' or a == ' ':
#         continue
#     else:
#         univ_orig.append(a)

In [0]:
# #print(univ_orig)
# univ_orig

In [0]:
# type(paragraphs1)
# start = 23
# arr5 = []
# len(arr)

In [0]:
# # rating = 2
# univ = -1

# # print(paragraphs1[23])
# length = len(paragraphs1)
# for rating in range(start,len(paragraphs1),7):
# #     print(univ)
#     univ = univ + 1
#     if(univ == len(arr)):
#         break
#     if arr[univ] == '' or arr[univ] == ' ':
#         continue
#     arr5.append(paragraphs1[rating])
# #     print(rating,paragraphs1[rating],arr[univ])
# print(arr5)

In [0]:
# rating_orig = []
# for each in arr5:
#  #   print(str(each.get_text()))
#     inp = str(each.get_text())
#     rating_orig.append(int(inp))

In [0]:
univ_rating = []

In [0]:
for i in range(len(univ_global)):
    univ_rating.append([univ_global[i],rating_global[i]])

In [0]:
df1 = pd.DataFrame(univ_rating, columns = ['University', 'Ratings'])

In [0]:
df1

                                University  Ratings
0                          ITMO University     4111
1                                     NNSU     3775
2    Massachusetts Institute of Technology     3736
3                                Moscow SU     3673
4                  The University of Tokyo     3614
..                                     ...      ...
219              Hangzhou No.2 High School     2387
220                                     ??     2386
221                           indeed, inc.     2385
222                                   ICHB     2385
223                     Yali Middle School     2384

[224 rows x 2 columns]

In [0]:
sum_of_rating = []
count_univ = []
for i in univ_global:
    inp = str(i)
    sum_of_rating.append(df1[df1['University'] == i]['Ratings'].mean())
    count_univ.append(df1[df1['University'] == i]['University'].count())

In [0]:
univ_rating_count = []
for i in range(len(univ_global)):
    univ_rating_count.append([univ_global[i],sum_of_rating[i],count_univ[i]])

In [0]:
df = pd.DataFrame(univ_rating_count, columns = ['University', 'Ratings','Count'])

In [0]:
df

                                University      Ratings  Count
0                          ITMO University  3129.111111      9
1                                     NNSU  3775.000000      1
2    Massachusetts Institute of Technology  3440.500000      2
3                                Moscow SU  3673.000000      1
4                  The University of Tokyo  2841.133333     15
..                                     ...          ...    ...
219              Hangzhou No.2 High School  2387.000000      1
220                                     ??  2386.000000      1
221                           indeed, inc.  2385.000000      1
222                                   ICHB  2385.000000      1
223                     Yali Middle School  2501.750000      4

[224 rows x 3 columns]

In [0]:
df.drop_duplicates(subset ="University",keep = False, inplace = True)

In [0]:
print("1. Colleges with n highest rating")
print("2. Colleges with n lowest rating")
print("\n")
inp1 = input("Enter your choice : ")
inp1 = int(inp1)
if inp1 == 1:
    inp = input("Enter value of n = ")
    n = int(inp)
    print("\n")
    print(df.nlargest(n,'Ratings'))
elif inp1 == 2:
    inp = input("Enter value of n = ")
    n = int(inp)
    print("\n")
    print(df.nsmallest(n,'Ratings'))
else:
    print("Wrong choice")

1. Colleges with n highest rating
2. Colleges with n lowest rating


Enter your choice : 1
Enter value of n = 13


                  University  Ratings  Count
1                       NNSU   3775.0      1
3                  Moscow SU   3673.0      1
5   Preferred Networks, Inc.   3485.0      1
8   Chengdu No.7 High School   3406.0      1
10              AtCoder Inc.   3383.0      1
13           Devexperts GmbH   3351.0      1
22        Harvard University   3224.0      1
25                    vk.com   3186.0      1
29                   Ural FU   3141.0      1
31              Rabbit House   3135.0      1
34             whiteCryption   3088.0      1
35                  Factorio   3077.0      1
40          AtCoder Inc. CEO   3056.0      1